import QtQuick
import QtQuick.Controls.Basic
import QtQuick.Layouts
Rectangle
{
ScrollView {
    id: control
    anchors.fill: parent
    ScrollBar.vertical: ScrollBar {
        parent: control
        x: control.mirrored ? 0 : control.width - width
        y: control.topPadding
        width: 40
        height: control.availableHeight
        active: true
    }
    TextArea {
        anchors.fill: parent
        text: '2025-12-04 14:29:32,953 ERROR: 回零失败\n' +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'
            +
            '2025-12-04 14:30:13,917 INFO: 开始自动对焦\n'

        }
    }
}